Диплом_0106/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Более28</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом_0106/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	//++Диплом
	ПолучитьДанныеИзВременногоХранилища(Параметры.Адрес);
	//конец
КонецПроцедуры   

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьДанныеИзВременногоХранилища(Адрес)
	//++Диплом
	Данные = ПолучитьИзВременногоХранилища(Адрес);
	Объект.Год = Данные.Год;
	Объект.Номер = Данные.номер;
	Объект.Дата = Данные.Дата;
	ОтпускаСотрудников = Данные.ОтпускаСотрудников;

	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
	
	Диаграмма.Очистить(); 
	Диаграмма.Обновление = Ложь;  
	
	Диаграмма.УстановитьПолныйИнтервал(НачалоГода(Объект.Год), КонецГода(Объект.Год));
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		ТекущаяТочка = Диаграмма.УстановитьТочку(Строка.Сотрудник);
		ТекущаяСерия = Диаграмма.УстановитьСерию("Отпуск");
		Значение = Диаграмма.ПолучитьЗначение(ТекущаяТочка, ТекущаяСерия);
		ТекущийИнтервал = Значение.Добавить(); 
		ТекущийИнтервал.Начало = Строка.ДатаНачала;
		ТекущийИнтервал.Конец = Строка.ДатаОкончания;
	КонецЦикла;
	
	Диаграмма.Обновление = Истина;
	//конец
КонецПроцедуры	

#КонецОбласти
